# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# Zsh
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"

# brew
brew "openjpeg"
brew "diff-so-fancy"
brew "ffmpeg", args: ["with-fdk-aac", "with-freetype", "with-frei0r", "with-libass", "with-libvorbis", "with-libvpx", "with-opencore-amr", "with-openjpeg", "with-opus", "with-rtmpdump", "with-speex", "with-theora", "with-tools"]
brew "ruby", link: false
brew "rbenv"
brew "rbenv-default-gems"
brew "fish"
brew "ack"
brew "the_silver_searcher"
brew "gnupg"
brew "trash"
brew "r"
brew "node"
brew "nvm"
brew "youtube-dl"
brew "tree"
brew "ghostscript"
brew "git"
brew "wget"
brew "vim"
brew "ranger"
brew "poppler"
brew "aspell"
brew "cmatrix"
brew "ripgrep"
brew "editorconfig"
brew "syncthing"
brew "borkdude/brew/clj-kondo"
brew "tmux"

# Cask
cask "google-chrome"
cask "firefox"
cask "opera"
cask "keepassxc"
cask "flux"
cask "dropbox"
cask "google-backup-and-sync"
cask "disk-inventory-x"
cask "emacs"
cask "visual-studio-code"
cask "bbedit"
cask "rstudio"
cask "texstudio"
cask "balenaetcher"
cask "iterm2"
cask "kodi"
cask "vlc"
cask "netspot"
cask "paintbrush"
cask "sdformatter"
cask "karabiner-elements"
cask "skim"
cask "keka"
cask "postman"
cask "android-file-transfer"
cask "spectacle"
cask "transmission"
cask "transmission-remote-gui"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "viber"
cask "skype"
cask "slack"
cask "cyberduck"
cask "tableplus"
cask "syncthing"
cask "adoptopenjdk"
cask "basictex"

# Fonts
cask "font-sourcecodepro-nerd-font-mono"
cask "font-sourcecodepro-nerd-font"
cask "font-source-code-pro-for-powerline"
cask "font-gnu-unifont"
