# Taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/gui"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"

# Zsh
brew "zsh"

# brew
brew "openjpeg"
brew "diff-so-fancy"
brew "ffmpeg", args: ["with-fdk-aac", "with-freetype", "with-frei0r", "with-libass", "with-libvorbis", "with-libvpx", "with-opencore-amr", "with-openjpeg", "with-opus", "with-rtmpdump", "with-speex", "with-theora", "with-tools"]
brew "ruby", link: false
brew "git-recent"
brew "rbenv"
brew "rbenv-default-gems"
brew "fish"
brew "iperf3"
brew "ack"
brew "the_silver_searcher"
brew "exa"
brew "httpie"
brew "gnupg"
brew "trash"
brew "go"
brew "postgresql"
brew "r"
brew "node"
brew "youtube-dl"
brew "tree"
brew "ghostscript"
brew "git"
brew "wget"
brew "vim"
brew "stow"
brew "ncdu"
brew "jump"
brew "imagemagick"
brew "speedtest-cli"
brew "testdisk"
brew "ranger"
brew "poppler"
brew "automake"
brew "aspell"
brew "terminal-notifier"
brew "swi-prolog"

# Cask
cask "google-chrome"
cask "firefox"
cask "opera"
cask "keepassx"
cask "batchmod"
cask "flux"
cask "dropbox"
cask "google-backup-and-sync"
cask "disk-inventory-x"
cask "eclipse-java"
cask "emacs"
cask "sublime-text"
cask "visual-studio-code"
cask "bbedit"
cask "rstudio"
cask "texstudio"
cask "etcher"
cask "filezilla"
cask "gimp"
cask "gpgtools"
cask "haskell-platform"
cask "iterm2"
cask "kodi"
cask "vlc"
cask "mactex"
cask "meld"
cask "netspot"
cask "paintbrush"
cask "pgadmin4"
cask "sdformatter"
cask "karabiner-elements"
cask "skim"
cask "keka"
cask "postman"
cask "android-file-transfer"
cask "spectacle"
cask "transmission"
cask "transmission-remote-gui"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "viber"
cask "skype"
cask "slack"
cask "java"

# Fonts
cask "font-sourcecodepro-nerd-font-mono"
cask "font-sourcecodepro-nerd-font"
cask "font-source-code-pro-for-powerline"
cask "font-gnu-unifont"
