# Taps
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "d12frosted/emacs-plus"

# Zsh
brew "zsh"

# brew
brew "coreutils"
brew "asdf"
brew "openjpeg"
brew "diff-so-fancy"
brew "ffmpeg"
brew "gnupg"
brew "trash"
brew "yt-dlp"
brew "git"
brew "wget"
brew "vim"
brew "poppler"
brew "aspell"
brew "cmatrix"
brew "ripgrep"
brew "fzf"
brew "editorconfig"
brew "atuin"
brew "tldr"
brew "colima"
brew "docker"
brew "htop"
brew "lazydocker"
brew "tmux"
brew "tree-sitter"
brew "jq"
brew "fd"

# Cask
cask "google-chrome"
cask "firefox"
cask "librewolf"
cask "opera"
cask "keepassxc"
cask "flux"
cask "dropbox"
cask "disk-inventory-x"
cask "emacs"
cask "vscodium"
cask "rstudio"
cask "balenaetcher"
cask "iterm2"
cask "kodi"
cask "vlc"
cask "foobar2000"
cask "netspot"
cask "paintbrush"
cask "karabiner-elements"
cask "skim"
cask "keka"
cask "postman"
cask "android-file-transfer"
cask "rectangle"
cask "transmission"
cask "transmission-remote-gui"
cask "discord"
cask "cyberduck"
cask "tableplus"
cask "syncthing"
cask "adoptopenjdk"
cask "gimp"
cask "kdenlive"
cask "syncthing"
cask "calibre"
cask "emacs-plus", args: ["with-xwidgets"]
cask "dbeaver-community"
cask "gpg-suite"
cask "lulu"
cask "audio-hijack"

# Fonts
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-gnu-unifont"
cask "font-aurulent-sans-mono-nerd-font"
